alibaba/AliOS-Things/platform/mcu/bk7231u/beken/driver/common/reg/reg_rc.h
// field definitions
#define RC_CH0_PA_OFF_DELAY_MASK   ((uint32_t)0x00FF0000)
#define RC_CH0_PA_OFF_DELAY_LSB    16
#define RC_CH0_PA_OFF_DELAY_WIDTH  ((uint32_t)0x00000008)
#define RC_CH0_PA_ON_DELAY_MASK    ((uint32_t)0x000000FF)
#define RC_CH0_PA_ON_DELAY_LSB     0
#define RC_CH0_PA_ON_DELAY_WIDTH   ((uint32_t)0x00000008)

#define RC_CH0_PA_OFF_DELAY_RST    0x0
#define RC_CH0_PA_ON_DELAY_RST     0x0

__INLINE void rc_ch0_pa_onoff_delay_pack(uint8_t ch0paoffdelay, uint8_t ch0paondelay)
{
    ASSERT_ERR((((uint32_t)ch0paoffdelay << 16) & ~((uint32_t)0x00FF0000)) == 0);
    ASSERT_ERR((((uint32_t)ch0paondelay << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(RC_CH0_PA_ONOFF_DELAY_ADDR,  ((uint32_t)ch0paoffdelay << 16) | ((uint32_t)ch0paondelay << 0));
}

__INLINE void rc_ch0_pa_onoff_delay_unpack(uint8_t *ch0paoffdelay, uint8_t *ch0paondelay)
{
    uint32_t localVal = REG_PL_RD(RC_CH0_PA_ONOFF_DELAY_ADDR);

    *ch0paoffdelay = (localVal & ((uint32_t)0x00FF0000)) >> 16;
    *ch0paondelay = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__INLINE uint8_t rc_ch0_pa_off_delay_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_CH0_PA_ONOFF_DELAY_ADDR);
    return ((localVal & ((uint32_t)0x00FF0000)) >> 16);
}

__INLINE void rc_ch0_pa_off_delay_setf(uint8_t ch0paoffdelay)
{
    ASSERT_ERR((((uint32_t)ch0paoffdelay << 16) & ~((uint32_t)0x00FF0000)) == 0);
    REG_PL_WR(RC_CH0_PA_ONOFF_DELAY_ADDR, (REG_PL_RD(RC_CH0_PA_ONOFF_DELAY_ADDR) & ~((uint32_t)0x00FF0000)) | ((uint32_t)ch0paoffdelay << 16));
}

__INLINE uint8_t rc_ch0_pa_on_delay_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_CH0_PA_ONOFF_DELAY_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

__INLINE void rc_ch0_pa_on_delay_setf(uint8_t ch0paondelay)
{
    ASSERT_ERR((((uint32_t)ch0paondelay << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(RC_CH0_PA_ONOFF_DELAY_ADDR, (REG_PL_RD(RC_CH0_PA_ONOFF_DELAY_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)ch0paondelay << 0));
}

/**
 * @brief CH0_SHDN_ONOFF_DELAY register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  23:16   CH0_SHDN_OFF_DELAY   0x0
 *  07:00    CH0_SHDN_ON_DELAY   0x0
 * </pre>
 */
#define RC_CH0_SHDN_ONOFF_DELAY_ADDR   0x01050044
#define RC_CH0_SHDN_ONOFF_DELAY_OFFSET 0x00000044
#define RC_CH0_SHDN_ONOFF_DELAY_INDEX  0x00000011
#define RC_CH0_SHDN_ONOFF_DELAY_RESET  0x00000000

__INLINE uint32_t rc_ch0_shdn_onoff_delay_get(void)
{
    return REG_PL_RD(RC_CH0_SHDN_ONOFF_DELAY_ADDR);
}

__INLINE void rc_ch0_shdn_onoff_delay_set(uint32_t value)
{
    REG_PL_WR(RC_CH0_SHDN_ONOFF_DELAY_ADDR, value);
}

// field definitions
#define RC_CH0_SHDN_OFF_DELAY_MASK   ((uint32_t)0x00FF0000)
#define RC_CH0_SHDN_OFF_DELAY_LSB    16
#define RC_CH0_SHDN_OFF_DELAY_WIDTH  ((uint32_t)0x00000008)
#define RC_CH0_SHDN_ON_DELAY_MASK    ((uint32_t)0x000000FF)
#define RC_CH0_SHDN_ON_DELAY_LSB     0
#define RC_CH0_SHDN_ON_DELAY_WIDTH   ((uint32_t)0x00000008)

#define RC_CH0_SHDN_OFF_DELAY_RST    0x0
#define RC_CH0_SHDN_ON_DELAY_RST     0x0

__INLINE void rc_ch0_shdn_onoff_delay_pack(uint8_t ch0shdnoffdelay, uint8_t ch0shdnondelay)
{
    ASSERT_ERR((((uint32_t)ch0shdnoffdelay << 16) & ~((uint32_t)0x00FF0000)) == 0);
    ASSERT_ERR((((uint32_t)ch0shdnondelay << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(RC_CH0_SHDN_ONOFF_DELAY_ADDR,  ((uint32_t)ch0shdnoffdelay << 16) | ((uint32_t)ch0shdnondelay << 0));
}

__INLINE void rc_ch0_shdn_onoff_delay_unpack(uint8_t *ch0shdnoffdelay, uint8_t *ch0shdnondelay)
{
    uint32_t localVal = REG_PL_RD(RC_CH0_SHDN_ONOFF_DELAY_ADDR);

    *ch0shdnoffdelay = (localVal & ((uint32_t)0x00FF0000)) >> 16;
    *ch0shdnondelay = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__INLINE uint8_t rc_ch0_shdn_off_delay_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_CH0_SHDN_ONOFF_DELAY_ADDR);
    return ((localVal & ((uint32_t)0x00FF0000)) >> 16);
}

__INLINE void rc_ch0_shdn_off_delay_setf(uint8_t ch0shdnoffdelay)
{
    ASSERT_ERR((((uint32_t)ch0shdnoffdelay << 16) & ~((uint32_t)0x00FF0000)) == 0);
    REG_PL_WR(RC_CH0_SHDN_ONOFF_DELAY_ADDR, (REG_PL_RD(RC_CH0_SHDN_ONOFF_DELAY_ADDR) & ~((uint32_t)0x00FF0000)) | ((uint32_t)ch0shdnoffdelay << 16));
}

__INLINE uint8_t rc_ch0_shdn_on_delay_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_CH0_SHDN_ONOFF_DELAY_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

__INLINE void rc_ch0_shdn_on_delay_setf(uint8_t ch0shdnondelay)
{
    ASSERT_ERR((((uint32_t)ch0shdnondelay << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_PL_WR(RC_CH0_SHDN_ONOFF_DELAY_ADDR, (REG_PL_RD(RC_CH0_SHDN_ONOFF_DELAY_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)ch0shdnondelay << 0));
}

/**
 * @brief CH0_FORCE register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     16             F_CH0_EN   0
 *  15:08              F_CH0_B   0x0
 *     03           F_CH0_RXHP   0
 *     02           F_CH0_TXEN   0
 *     01           F_CH0_RXEN   0
 *     00           F_CH0_SHDN   0
 * </pre>
 */
#define RC_CH0_FORCE_ADDR   0x01050064
#define RC_CH0_FORCE_OFFSET 0x00000064
#define RC_CH0_FORCE_INDEX  0x00000019
#define RC_CH0_FORCE_RESET  0x00000000

__INLINE uint32_t rc_ch0_force_get(void)
{
    return REG_PL_RD(RC_CH0_FORCE_ADDR);
}

__INLINE void rc_ch0_force_set(uint32_t value)
{
    REG_PL_WR(RC_CH0_FORCE_ADDR, value);
}

// field definitions
#define RC_F_CH0_EN_BIT      ((uint32_t)0x00010000)
#define RC_F_CH0_EN_POS      16
#define RC_F_CH0_B_MASK      ((uint32_t)0x0000FF00)
#define RC_F_CH0_B_LSB       8
#define RC_F_CH0_B_WIDTH     ((uint32_t)0x00000008)
#define RC_F_CH0_RXHP_BIT    ((uint32_t)0x00000008)
#define RC_F_CH0_RXHP_POS    3
#define RC_F_CH0_TXEN_BIT    ((uint32_t)0x00000004)
#define RC_F_CH0_TXEN_POS    2
#define RC_F_CH0_RXEN_BIT    ((uint32_t)0x00000002)
#define RC_F_CH0_RXEN_POS    1
#define RC_F_CH0_SHDN_BIT    ((uint32_t)0x00000001)
#define RC_F_CH0_SHDN_POS    0

#define RC_F_CH0_EN_RST      0x0
#define RC_F_CH0_B_RST       0x0
#define RC_F_CH0_RXHP_RST    0x0
#define RC_F_CH0_TXEN_RST    0x0
#define RC_F_CH0_RXEN_RST    0x0
#define RC_F_CH0_SHDN_RST    0x0

__INLINE void rc_ch0_force_pack(uint8_t fch0en, uint8_t fch0b, uint8_t fch0rxhp, uint8_t fch0txen, uint8_t fch0rxen, uint8_t fch0shdn)
{
    ASSERT_ERR((((uint32_t)fch0en << 16) & ~((uint32_t)0x00010000)) == 0);
    ASSERT_ERR((((uint32_t)fch0b << 8) & ~((uint32_t)0x0000FF00)) == 0);
    ASSERT_ERR((((uint32_t)fch0rxhp << 3) & ~((uint32_t)0x00000008)) == 0);
    ASSERT_ERR((((uint32_t)fch0txen << 2) & ~((uint32_t)0x00000004)) == 0);
    ASSERT_ERR((((uint32_t)fch0rxen << 1) & ~((uint32_t)0x00000002)) == 0);
    ASSERT_ERR((((uint32_t)fch0shdn << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_PL_WR(RC_CH0_FORCE_ADDR,  ((uint32_t)fch0en << 16) | ((uint32_t)fch0b << 8) | ((uint32_t)fch0rxhp << 3) | ((uint32_t)fch0txen << 2) | ((uint32_t)fch0rxen << 1) | ((uint32_t)fch0shdn << 0));
}

__INLINE void rc_ch0_force_unpack(uint8_t *fch0en, uint8_t *fch0b, uint8_t *fch0rxhp, uint8_t *fch0txen, uint8_t *fch0rxen, uint8_t *fch0shdn)
{
    uint32_t localVal = REG_PL_RD(RC_CH0_FORCE_ADDR);

    *fch0en = (localVal & ((uint32_t)0x00010000)) >> 16;
    *fch0b = (localVal & ((uint32_t)0x0000FF00)) >> 8;
    *fch0rxhp = (localVal & ((uint32_t)0x00000008)) >> 3;
    *fch0txen = (localVal & ((uint32_t)0x00000004)) >> 2;
    *fch0rxen = (localVal & ((uint32_t)0x00000002)) >> 1;
    *fch0shdn = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__INLINE uint8_t rc_f_ch0_en_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_CH0_FORCE_ADDR);
    return ((localVal & ((uint32_t)0x00010000)) >> 16);
}

__INLINE void rc_f_ch0_en_setf(uint8_t fch0en)
{
    ASSERT_ERR((((uint32_t)fch0en << 16) & ~((uint32_t)0x00010000)) == 0);
    REG_PL_WR(RC_CH0_FORCE_ADDR, (REG_PL_RD(RC_CH0_FORCE_ADDR) & ~((uint32_t)0x00010000)) | ((uint32_t)fch0en << 16));
}

__INLINE uint8_t rc_f_ch0_b_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_CH0_FORCE_ADDR);
    return ((localVal & ((uint32_t)0x0000FF00)) >> 8);
}

__INLINE void rc_f_ch0_b_setf(uint8_t fch0b)
{
    ASSERT_ERR((((uint32_t)fch0b << 8) & ~((uint32_t)0x0000FF00)) == 0);
    REG_PL_WR(RC_CH0_FORCE_ADDR, (REG_PL_RD(RC_CH0_FORCE_ADDR) & ~((uint32_t)0x0000FF00)) | ((uint32_t)fch0b << 8));
}

