alibaba/AliOS-Things/platform/mcu/bk7231u/beken/driver/common/reg/reg_rc.h
__INLINE uint8_t rc_f_ch0_rxhp_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_CH0_FORCE_ADDR);
    return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

__INLINE void rc_f_ch0_rxhp_setf(uint8_t fch0rxhp)
{
    ASSERT_ERR((((uint32_t)fch0rxhp << 3) & ~((uint32_t)0x00000008)) == 0);
    REG_PL_WR(RC_CH0_FORCE_ADDR, (REG_PL_RD(RC_CH0_FORCE_ADDR) & ~((uint32_t)0x00000008)) | ((uint32_t)fch0rxhp << 3));
}

__INLINE uint8_t rc_f_ch0_txen_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_CH0_FORCE_ADDR);
    return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

__INLINE void rc_f_ch0_txen_setf(uint8_t fch0txen)
{
    ASSERT_ERR((((uint32_t)fch0txen << 2) & ~((uint32_t)0x00000004)) == 0);
    REG_PL_WR(RC_CH0_FORCE_ADDR, (REG_PL_RD(RC_CH0_FORCE_ADDR) & ~((uint32_t)0x00000004)) | ((uint32_t)fch0txen << 2));
}

__INLINE uint8_t rc_f_ch0_rxen_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_CH0_FORCE_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__INLINE void rc_f_ch0_rxen_setf(uint8_t fch0rxen)
{
    ASSERT_ERR((((uint32_t)fch0rxen << 1) & ~((uint32_t)0x00000002)) == 0);
    REG_PL_WR(RC_CH0_FORCE_ADDR, (REG_PL_RD(RC_CH0_FORCE_ADDR) & ~((uint32_t)0x00000002)) | ((uint32_t)fch0rxen << 1));
}

__INLINE uint8_t rc_f_ch0_shdn_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_CH0_FORCE_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

__INLINE void rc_f_ch0_shdn_setf(uint8_t fch0shdn)
{
    ASSERT_ERR((((uint32_t)fch0shdn << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_PL_WR(RC_CH0_FORCE_ADDR, (REG_PL_RD(RC_CH0_FORCE_ADDR) & ~((uint32_t)0x00000001)) | ((uint32_t)fch0shdn << 0));
}

/**
 * @brief MISC_FORCE register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     01              F_TX_ON   0
 *     00              F_RX_ON   0
 * </pre>
 */
#define RC_MISC_FORCE_ADDR   0x01050070
#define RC_MISC_FORCE_OFFSET 0x00000070
#define RC_MISC_FORCE_INDEX  0x0000001C
#define RC_MISC_FORCE_RESET  0x00000000

__INLINE uint32_t rc_misc_force_get(void)
{
    return REG_PL_RD(RC_MISC_FORCE_ADDR);
}

__INLINE void rc_misc_force_set(uint32_t value)
{
    REG_PL_WR(RC_MISC_FORCE_ADDR, value);
}

// field definitions
#define RC_F_TX_ON_BIT    ((uint32_t)0x00000002)
#define RC_F_TX_ON_POS    1
#define RC_F_RX_ON_BIT    ((uint32_t)0x00000001)
#define RC_F_RX_ON_POS    0

#define RC_F_TX_ON_RST    0x0
#define RC_F_RX_ON_RST    0x0

__INLINE void rc_misc_force_pack(uint8_t ftxon, uint8_t frxon)
{
    ASSERT_ERR((((uint32_t)ftxon << 1) & ~((uint32_t)0x00000002)) == 0);
    ASSERT_ERR((((uint32_t)frxon << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_PL_WR(RC_MISC_FORCE_ADDR,  ((uint32_t)ftxon << 1) | ((uint32_t)frxon << 0));
}

__INLINE void rc_misc_force_unpack(uint8_t *ftxon, uint8_t *frxon)
{
    uint32_t localVal = REG_PL_RD(RC_MISC_FORCE_ADDR);

    *ftxon = (localVal & ((uint32_t)0x00000002)) >> 1;
    *frxon = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__INLINE uint8_t rc_f_tx_on_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_MISC_FORCE_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__INLINE void rc_f_tx_on_setf(uint8_t ftxon)
{
    ASSERT_ERR((((uint32_t)ftxon << 1) & ~((uint32_t)0x00000002)) == 0);
    REG_PL_WR(RC_MISC_FORCE_ADDR, (REG_PL_RD(RC_MISC_FORCE_ADDR) & ~((uint32_t)0x00000002)) | ((uint32_t)ftxon << 1));
}

__INLINE uint8_t rc_f_rx_on_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_MISC_FORCE_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

__INLINE void rc_f_rx_on_setf(uint8_t frxon)
{
    ASSERT_ERR((((uint32_t)frxon << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_PL_WR(RC_MISC_FORCE_ADDR, (REG_PL_RD(RC_MISC_FORCE_ADDR) & ~((uint32_t)0x00000001)) | ((uint32_t)frxon << 0));
}

/**
 * @brief FE_RX_DEL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  11:00         FE_RX_ON_DEL   0x0
 * </pre>
 */
#define RC_FE_RX_DEL_ADDR   0x01050078
#define RC_FE_RX_DEL_OFFSET 0x00000078
#define RC_FE_RX_DEL_INDEX  0x0000001E
#define RC_FE_RX_DEL_RESET  0x00000000

__INLINE uint32_t rc_fe_rx_del_get(void)
{
    return REG_PL_RD(RC_FE_RX_DEL_ADDR);
}

__INLINE void rc_fe_rx_del_set(uint32_t value)
{
    REG_PL_WR(RC_FE_RX_DEL_ADDR, value);
}

// field definitions
#define RC_FE_RX_ON_DEL_MASK   ((uint32_t)0x00000FFF)
#define RC_FE_RX_ON_DEL_LSB    0
#define RC_FE_RX_ON_DEL_WIDTH  ((uint32_t)0x0000000C)

#define RC_FE_RX_ON_DEL_RST    0x0

__INLINE uint16_t rc_fe_rx_on_del_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_FE_RX_DEL_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x00000FFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rc_fe_rx_on_del_setf(uint16_t ferxondel)
{
    ASSERT_ERR((((uint32_t)ferxondel << 0) & ~((uint32_t)0x00000FFF)) == 0);
    REG_PL_WR(RC_FE_RX_DEL_ADDR, (uint32_t)ferxondel << 0);
}

/**
 * @brief TRX_REG0 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00             TRX_REG0   0x0
 * </pre>
 */
#define RC_TRX_REG0_ADDR   0x01050080
#define RC_TRX_REG0_OFFSET 0x00000080
#define RC_TRX_REG0_INDEX  0x00000020
#define RC_TRX_REG0_RESET  0x00000000

__INLINE uint32_t rc_trx_reg0_get(void)
{
    return REG_PL_RD(RC_TRX_REG0_ADDR);
}

__INLINE void rc_trx_reg0_set(uint32_t value)
{
    REG_PL_WR(RC_TRX_REG0_ADDR, value);
}

// field definitions
#define RC_TRX_REG0_MASK   ((uint32_t)0xFFFFFFFF)
#define RC_TRX_REG0_LSB    0
#define RC_TRX_REG0_WIDTH  ((uint32_t)0x00000020)

#define RC_TRX_REG0_RST    0x0

__INLINE uint32_t rc_trx_reg0_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TRX_REG0_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rc_trx_reg0_setf(uint32_t trxreg0)
{
    ASSERT_ERR((((uint32_t)trxreg0 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(RC_TRX_REG0_ADDR, (uint32_t)trxreg0 << 0);
}

/**
 * @brief TRX_REG1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00             TRX_REG1   0x0
 * </pre>
 */
#define RC_TRX_REG1_ADDR   0x01050084
#define RC_TRX_REG1_OFFSET 0x00000084
#define RC_TRX_REG1_INDEX  0x00000021
#define RC_TRX_REG1_RESET  0x00000000

__INLINE uint32_t rc_trx_reg1_get(void)
{
    return REG_PL_RD(RC_TRX_REG1_ADDR);
}

__INLINE void rc_trx_reg1_set(uint32_t value)
{
    REG_PL_WR(RC_TRX_REG1_ADDR, value);
}

