alibaba/AliOS-Things/platform/mcu/bk7231u/beken/driver/common/reg/reg_rc.h
__INLINE uint32_t rc_trx_reg25_get(void)
{
    return REG_PL_RD(RC_TRX_REG25_ADDR);
}

__INLINE void rc_trx_reg25_set(uint32_t value)
{
    REG_PL_WR(RC_TRX_REG25_ADDR, value);
}

// field definitions
#define RC_TRX_REG25_MASK   ((uint32_t)0xFFFFFFFF)
#define RC_TRX_REG25_LSB    0
#define RC_TRX_REG25_WIDTH  ((uint32_t)0x00000020)

#define RC_TRX_REG25_RST    0x0

__INLINE uint32_t rc_trx_reg25_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TRX_REG25_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rc_trx_reg25_setf(uint32_t trxreg25)
{
    ASSERT_ERR((((uint32_t)trxreg25 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(RC_TRX_REG25_ADDR, (uint32_t)trxreg25 << 0);
}

/**
 * @brief TRX_REG26 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00            TRX_REG26   0x0
 * </pre>
 */
#define RC_TRX_REG26_ADDR   0x010500E8
#define RC_TRX_REG26_OFFSET 0x000000E8
#define RC_TRX_REG26_INDEX  0x0000003A
#define RC_TRX_REG26_RESET  0x00000000

__INLINE uint32_t rc_trx_reg26_get(void)
{
    return REG_PL_RD(RC_TRX_REG26_ADDR);
}

__INLINE void rc_trx_reg26_set(uint32_t value)
{
    REG_PL_WR(RC_TRX_REG26_ADDR, value);
}

// field definitions
#define RC_TRX_REG26_MASK   ((uint32_t)0xFFFFFFFF)
#define RC_TRX_REG26_LSB    0
#define RC_TRX_REG26_WIDTH  ((uint32_t)0x00000020)

#define RC_TRX_REG26_RST    0x0

__INLINE uint32_t rc_trx_reg26_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TRX_REG26_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rc_trx_reg26_setf(uint32_t trxreg26)
{
    ASSERT_ERR((((uint32_t)trxreg26 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(RC_TRX_REG26_ADDR, (uint32_t)trxreg26 << 0);
}

/**
 * @brief TRX_REG27 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00            TRX_REG27   0x0
 * </pre>
 */
#define RC_TRX_REG27_ADDR   0x010500EC
#define RC_TRX_REG27_OFFSET 0x000000EC
#define RC_TRX_REG27_INDEX  0x0000003B
#define RC_TRX_REG27_RESET  0x00000000

__INLINE uint32_t rc_trx_reg27_get(void)
{
    return REG_PL_RD(RC_TRX_REG27_ADDR);
}

__INLINE void rc_trx_reg27_set(uint32_t value)
{
    REG_PL_WR(RC_TRX_REG27_ADDR, value);
}

// field definitions
#define RC_TRX_REG27_MASK   ((uint32_t)0xFFFFFFFF)
#define RC_TRX_REG27_LSB    0
#define RC_TRX_REG27_WIDTH  ((uint32_t)0x00000020)

#define RC_TRX_REG27_RST    0x0

__INLINE uint32_t rc_trx_reg27_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TRX_REG27_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rc_trx_reg27_setf(uint32_t trxreg27)
{
    ASSERT_ERR((((uint32_t)trxreg27 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(RC_TRX_REG27_ADDR, (uint32_t)trxreg27 << 0);
}

/**
 * @brief RX_AVG_CALC register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31         RX_DC_CAL_EN   0
 *     30          RX_AVG_MODE   0
 *  23:12          RX_AVG_I_RD   0x0
 *  11:00          RX_AVG_Q_RD   0x0
 * </pre>
 */
#define RC_RX_AVG_CALC_ADDR   0x010500F0
#define RC_RX_AVG_CALC_OFFSET 0x000000F0
#define RC_RX_AVG_CALC_INDEX  0x0000003C
#define RC_RX_AVG_CALC_RESET  0x00000000

__INLINE uint32_t rc_rx_avg_calc_get(void)
{
    return REG_PL_RD(RC_RX_AVG_CALC_ADDR);
}

__INLINE void rc_rx_avg_calc_set(uint32_t value)
{
    REG_PL_WR(RC_RX_AVG_CALC_ADDR, value);
}

// field definitions
#define RC_RX_DC_CAL_EN_BIT    ((uint32_t)0x80000000)
#define RC_RX_DC_CAL_EN_POS    31
#define RC_RX_AVG_MODE_BIT     ((uint32_t)0x40000000)
#define RC_RX_AVG_MODE_POS     30
#define RC_RX_AVG_I_RD_MASK    ((uint32_t)0x00FFF000)
#define RC_RX_AVG_I_RD_LSB     12
#define RC_RX_AVG_I_RD_WIDTH   ((uint32_t)0x0000000C)
#define RC_RX_AVG_Q_RD_MASK    ((uint32_t)0x00000FFF)
#define RC_RX_AVG_Q_RD_LSB     0
#define RC_RX_AVG_Q_RD_WIDTH   ((uint32_t)0x0000000C)

#define RC_RX_DC_CAL_EN_RST    0x0
#define RC_RX_AVG_MODE_RST     0x0
#define RC_RX_AVG_I_RD_RST     0x0
#define RC_RX_AVG_Q_RD_RST     0x0

__INLINE void rc_rx_avg_calc_pack(uint8_t rxdccalen, uint8_t rxavgmode, uint16_t rxavgird, uint16_t rxavgqrd)
{
    ASSERT_ERR((((uint32_t)rxdccalen << 31) & ~((uint32_t)0x80000000)) == 0);
    ASSERT_ERR((((uint32_t)rxavgmode << 30) & ~((uint32_t)0x40000000)) == 0);
    ASSERT_ERR((((uint32_t)rxavgird << 12) & ~((uint32_t)0x00FFF000)) == 0);
    ASSERT_ERR((((uint32_t)rxavgqrd << 0) & ~((uint32_t)0x00000FFF)) == 0);
    REG_PL_WR(RC_RX_AVG_CALC_ADDR,  ((uint32_t)rxdccalen << 31) | ((uint32_t)rxavgmode << 30) | ((uint32_t)rxavgird << 12) | ((uint32_t)rxavgqrd << 0));
}

__INLINE void rc_rx_avg_calc_unpack(uint8_t *rxdccalen, uint8_t *rxavgmode, uint16_t *rxavgird, uint16_t *rxavgqrd)
{
    uint32_t localVal = REG_PL_RD(RC_RX_AVG_CALC_ADDR);

    *rxdccalen = (localVal & ((uint32_t)0x80000000)) >> 31;
    *rxavgmode = (localVal & ((uint32_t)0x40000000)) >> 30;
    *rxavgird = (localVal & ((uint32_t)0x00FFF000)) >> 12;
    *rxavgqrd = (localVal & ((uint32_t)0x00000FFF)) >> 0;
}

__INLINE uint8_t rc_rx_dc_cal_en_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_RX_AVG_CALC_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__INLINE void rc_rx_dc_cal_en_setf(uint8_t rxdccalen)
{
    ASSERT_ERR((((uint32_t)rxdccalen << 31) & ~((uint32_t)0x80000000)) == 0);
    REG_PL_WR(RC_RX_AVG_CALC_ADDR, (REG_PL_RD(RC_RX_AVG_CALC_ADDR) & ~((uint32_t)0x80000000)) | ((uint32_t)rxdccalen << 31));
}

__INLINE uint8_t rc_rx_avg_mode_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_RX_AVG_CALC_ADDR);
    return ((localVal & ((uint32_t)0x40000000)) >> 30);
}

__INLINE void rc_rx_avg_mode_setf(uint8_t rxavgmode)
{
    ASSERT_ERR((((uint32_t)rxavgmode << 30) & ~((uint32_t)0x40000000)) == 0);
    REG_PL_WR(RC_RX_AVG_CALC_ADDR, (REG_PL_RD(RC_RX_AVG_CALC_ADDR) & ~((uint32_t)0x40000000)) | ((uint32_t)rxavgmode << 30));
}

__INLINE uint16_t rc_rx_avg_i_rd_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_RX_AVG_CALC_ADDR);
    return ((localVal & ((uint32_t)0x00FFF000)) >> 12);
}

