alibaba/AliOS-Things/platform/mcu/bk7231u/beken/driver/common/reg/reg_rc.h
    *agcmapmode = (localVal & ((uint32_t)0x80000000)) >> 31;
    *agclnard = (localVal & ((uint32_t)0x60000000)) >> 29;
    *agcbufrd = (localVal & ((uint32_t)0x10000000)) >> 28;
    *agcpgard = (localVal & ((uint32_t)0x0F000000)) >> 24;
    *tssird = (localVal & ((uint32_t)0x00FF0000)) >> 16;
    *stsaradc = (localVal & ((uint32_t)0x0000C000)) >> 14;
    *strxadc = (localVal & ((uint32_t)0x00003000)) >> 12;
    *txdcn = (localVal & ((uint32_t)0x00000C00)) >> 10;
    *dselva = (localVal & ((uint32_t)0x00000200)) >> 9;
    *tssipoutth = (localVal & ((uint32_t)0x000001FE)) >> 1;
    *strxadciq = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__INLINE uint8_t rc_agc_map_mode_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_AGC_CFG_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__INLINE void rc_agc_map_mode_setf(uint8_t agcmapmode)
{
    ASSERT_ERR((((uint32_t)agcmapmode << 31) & ~((uint32_t)0x80000000)) == 0);
    REG_PL_WR(RC_AGC_CFG_ADDR, (REG_PL_RD(RC_AGC_CFG_ADDR) & ~((uint32_t)0x80000000)) | ((uint32_t)agcmapmode << 31));
}

__INLINE uint8_t rc_agc_lna_rd_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_AGC_CFG_ADDR);
    return ((localVal & ((uint32_t)0x60000000)) >> 29);
}

__INLINE void rc_agc_lna_rd_setf(uint8_t agclnard)
{
    ASSERT_ERR((((uint32_t)agclnard << 29) & ~((uint32_t)0x60000000)) == 0);
    REG_PL_WR(RC_AGC_CFG_ADDR, (REG_PL_RD(RC_AGC_CFG_ADDR) & ~((uint32_t)0x60000000)) | ((uint32_t)agclnard << 29));
}

__INLINE uint8_t rc_agc_buf_rd_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_AGC_CFG_ADDR);
    return ((localVal & ((uint32_t)0x10000000)) >> 28);
}

__INLINE void rc_agc_buf_rd_setf(uint8_t agcbufrd)
{
    ASSERT_ERR((((uint32_t)agcbufrd << 28) & ~((uint32_t)0x10000000)) == 0);
    REG_PL_WR(RC_AGC_CFG_ADDR, (REG_PL_RD(RC_AGC_CFG_ADDR) & ~((uint32_t)0x10000000)) | ((uint32_t)agcbufrd << 28));
}

__INLINE uint8_t rc_agc_pga_rd_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_AGC_CFG_ADDR);
    return ((localVal & ((uint32_t)0x0F000000)) >> 24);
}

__INLINE void rc_agc_pga_rd_setf(uint8_t agcpgard)
{
    ASSERT_ERR((((uint32_t)agcpgard << 24) & ~((uint32_t)0x0F000000)) == 0);
    REG_PL_WR(RC_AGC_CFG_ADDR, (REG_PL_RD(RC_AGC_CFG_ADDR) & ~((uint32_t)0x0F000000)) | ((uint32_t)agcpgard << 24));
}

__INLINE uint8_t rc_tssi_rd_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_AGC_CFG_ADDR);
    return ((localVal & ((uint32_t)0x00FF0000)) >> 16);
}

__INLINE void rc_tssi_rd_setf(uint8_t tssird)
{
    ASSERT_ERR((((uint32_t)tssird << 16) & ~((uint32_t)0x00FF0000)) == 0);
    REG_PL_WR(RC_AGC_CFG_ADDR, (REG_PL_RD(RC_AGC_CFG_ADDR) & ~((uint32_t)0x00FF0000)) | ((uint32_t)tssird << 16));
}

__INLINE uint8_t rc_st_sar_adc_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_AGC_CFG_ADDR);
    return ((localVal & ((uint32_t)0x0000C000)) >> 14);
}

__INLINE void rc_st_sar_adc_setf(uint8_t stsaradc)
{
    ASSERT_ERR((((uint32_t)stsaradc << 14) & ~((uint32_t)0x0000C000)) == 0);
    REG_PL_WR(RC_AGC_CFG_ADDR, (REG_PL_RD(RC_AGC_CFG_ADDR) & ~((uint32_t)0x0000C000)) | ((uint32_t)stsaradc << 14));
}

__INLINE uint8_t rc_st_rx_adc_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_AGC_CFG_ADDR);
    return ((localVal & ((uint32_t)0x00003000)) >> 12);
}

__INLINE void rc_st_rx_adc_setf(uint8_t strxadc)
{
    ASSERT_ERR((((uint32_t)strxadc << 12) & ~((uint32_t)0x00003000)) == 0);
    REG_PL_WR(RC_AGC_CFG_ADDR, (REG_PL_RD(RC_AGC_CFG_ADDR) & ~((uint32_t)0x00003000)) | ((uint32_t)strxadc << 12));
}

__INLINE uint8_t rc_tx_dc_n_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_AGC_CFG_ADDR);
    return ((localVal & ((uint32_t)0x00000C00)) >> 10);
}

__INLINE void rc_tx_dc_n_setf(uint8_t txdcn)
{
    ASSERT_ERR((((uint32_t)txdcn << 10) & ~((uint32_t)0x00000C00)) == 0);
    REG_PL_WR(RC_AGC_CFG_ADDR, (REG_PL_RD(RC_AGC_CFG_ADDR) & ~((uint32_t)0x00000C00)) | ((uint32_t)txdcn << 10));
}

__INLINE uint8_t rc_dsel_va_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_AGC_CFG_ADDR);
    return ((localVal & ((uint32_t)0x00000200)) >> 9);
}

__INLINE void rc_dsel_va_setf(uint8_t dselva)
{
    ASSERT_ERR((((uint32_t)dselva << 9) & ~((uint32_t)0x00000200)) == 0);
    REG_PL_WR(RC_AGC_CFG_ADDR, (REG_PL_RD(RC_AGC_CFG_ADDR) & ~((uint32_t)0x00000200)) | ((uint32_t)dselva << 9));
}

__INLINE uint8_t rc_tssi_pout_th_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_AGC_CFG_ADDR);
    return ((localVal & ((uint32_t)0x000001FE)) >> 1);
}

__INLINE void rc_tssi_pout_th_setf(uint8_t tssipoutth)
{
    ASSERT_ERR((((uint32_t)tssipoutth << 1) & ~((uint32_t)0x000001FE)) == 0);
    REG_PL_WR(RC_AGC_CFG_ADDR, (REG_PL_RD(RC_AGC_CFG_ADDR) & ~((uint32_t)0x000001FE)) | ((uint32_t)tssipoutth << 1));
}

__INLINE uint8_t rc_st_rx_adc_iq_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_AGC_CFG_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

__INLINE void rc_st_rx_adc_iq_setf(uint8_t strxadciq)
{
    ASSERT_ERR((((uint32_t)strxadciq << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_PL_WR(RC_AGC_CFG_ADDR, (REG_PL_RD(RC_AGC_CFG_ADDR) & ~((uint32_t)0x00000001)) | ((uint32_t)strxadciq << 0));
}

/**
 * @brief TRX_SPI_INTLV register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31         TRX_BANK_RPT   0
 *  09:00        TRX_SPI_INTLV   0x40
 * </pre>
 */
#define RC_TRX_SPI_INTLV_ADDR   0x01050170
#define RC_TRX_SPI_INTLV_OFFSET 0x00000170
#define RC_TRX_SPI_INTLV_INDEX  0x0000005C
#define RC_TRX_SPI_INTLV_RESET  0x00000040

__INLINE uint32_t rc_trx_spi_intlv_get(void)
{
    return REG_PL_RD(RC_TRX_SPI_INTLV_ADDR);
}

__INLINE void rc_trx_spi_intlv_set(uint32_t value)
{
    REG_PL_WR(RC_TRX_SPI_INTLV_ADDR, value);
}

// field definitions
#define RC_TRX_BANK_RPT_BIT     ((uint32_t)0x80000000)
#define RC_TRX_BANK_RPT_POS     31
#define RC_TRX_SPI_INTLV_MASK   ((uint32_t)0x000003FF)
#define RC_TRX_SPI_INTLV_LSB    0
#define RC_TRX_SPI_INTLV_WIDTH  ((uint32_t)0x0000000A)

#define RC_TRX_BANK_RPT_RST     0x0
#define RC_TRX_SPI_INTLV_RST    0x40

