alibaba/AliOS-Things/platform/mcu/bk7231u/beken/driver/common/reg/reg_rc.h
#define RC_ADDA_REG4_RST    0x0

__INLINE uint32_t rc_adda_reg4_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_ADDA_REG4_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rc_adda_reg4_setf(uint32_t addareg4)
{
    ASSERT_ERR((((uint32_t)addareg4 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(RC_ADDA_REG4_ADDR, (uint32_t)addareg4 << 0);
}

/**
 * @brief ADDA_REG5 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00            ADDA_REG5   0x0
 * </pre>
 */
#define RC_ADDA_REG5_ADDR   0x010501A4
#define RC_ADDA_REG5_OFFSET 0x000001A4
#define RC_ADDA_REG5_INDEX  0x00000069
#define RC_ADDA_REG5_RESET  0x00000000

__INLINE uint32_t rc_adda_reg5_get(void)
{
    return REG_PL_RD(RC_ADDA_REG5_ADDR);
}

__INLINE void rc_adda_reg5_set(uint32_t value)
{
    REG_PL_WR(RC_ADDA_REG5_ADDR, value);
}

// field definitions
#define RC_ADDA_REG5_MASK   ((uint32_t)0xFFFFFFFF)
#define RC_ADDA_REG5_LSB    0
#define RC_ADDA_REG5_WIDTH  ((uint32_t)0x00000020)

#define RC_ADDA_REG5_RST    0x0

__INLINE uint32_t rc_adda_reg5_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_ADDA_REG5_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rc_adda_reg5_setf(uint32_t addareg5)
{
    ASSERT_ERR((((uint32_t)addareg5 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(RC_ADDA_REG5_ADDR, (uint32_t)addareg5 << 0);
}

/**
 * @brief ADDA_REG_STAT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  05:00        ADDA_REG_STAT   0x0
 * </pre>
 */
#define RC_ADDA_REG_STAT_ADDR   0x010501A8
#define RC_ADDA_REG_STAT_OFFSET 0x000001A8
#define RC_ADDA_REG_STAT_INDEX  0x0000006A
#define RC_ADDA_REG_STAT_RESET  0x00000000

__INLINE uint32_t rc_adda_reg_stat_get(void)
{
    return REG_PL_RD(RC_ADDA_REG_STAT_ADDR);
}

__INLINE void rc_adda_reg_stat_set(uint32_t value)
{
    REG_PL_WR(RC_ADDA_REG_STAT_ADDR, value);
}

// field definitions
#define RC_ADDA_REG_STAT_MASK   ((uint32_t)0x0000003F)
#define RC_ADDA_REG_STAT_LSB    0
#define RC_ADDA_REG_STAT_WIDTH  ((uint32_t)0x00000006)

#define RC_ADDA_REG_STAT_RST    0x0

__INLINE uint8_t rc_adda_reg_stat_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_ADDA_REG_STAT_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x0000003F)) == 0);
    return (localVal >> 0);
}


#endif // _REG_RC_H_

